rizinorg/rizin/librz/arch/isa/tms320/c55x_plus/c55plus_analysis.c
// SPDX-FileCopyrightText: 2014 Ilya V. Matveychikov <i.matveychikov@milabs.ru>
// SPDX-FileCopyrightText: 2014 montekki <fedor.sakharov@gmail.com>
// SPDX-FileCopyrightText: 2026 RizinOrg <info@rizin.re>
// SPDX-License-Identifier: LGPL-3.0-only

#include <string.h>
#include <rz_types.h>
#include <rz_endian.h>
#include <rz_analysis.h>

#include "c55plus_analysis.h"
#include "ins.h"
#include "../tms320c55x_insn.h"
#include "../tms320_dasm.h"

/**
 * \file c55plus_analysis.c
 *
 * TMS320C55x+ analysis: classify opcodes, resolve branch targets, set
 * basic-block fallthrough, fill in src/dst/val and stack effects.
 *
 * Pure byte-level dispatch -- no mnemonic-string matching. Each
 * recognised opcode is dispatched on its leading byte (or leading byte
 * + a small subset of the second byte where the prefix family is
 * shared by multiple instructions).
 *
 * The encoding map below was extracted from SWPU104 chapter 6 (Dec
 * 2006 'Algebraic Instruction Set' reference) and SWPU086 chapter 4
 * (May 2005 'CPU Reference Guide', Preliminary), then cross-validated
 * against TI dis55.exe v4.3.6 (CCSv5 c55x_plus SDK, Feb 2010) on the
 * testbins#289 c55xp corpus.
 *
 * Branch and control-flow encodings:
 *
 *   0x00 ..       NOP / IDLE / RETI / to_word    sec.6.5.11, sec.6.5.20, sec.6.5.16
 *   0x02 b1       B/CALL ACx (indirect register) sec.6.5.2, sec.6.5.6
 *   0x03 b1       INTR #k4 / TRAP #k4            sec.6.5.13, sec.6.5.19
 *   0x04 / 0x06   XCC predicated execute         sec.6.5.9
 *   0x05 / 0x07   XCCPART                        sec.6.5.9
 *   0x08          RETCC                          sec.6.5.17
 *   0x20          NOP   (1 byte)                 sec.6.5.11
 *   0x21          RET   (1 byte)                 sec.6.5.16
 *   0x68 hh ll    B    short-relative            sec.6.5.2
 *   0x69 hh ll    CALL short-relative            sec.6.5.6
 *   0x6A ss dst   BCC  short-relative (8-bit)    sec.6.5.1
 *   0x6C / 0x6D   RPT / RPTCC                    sec.6.5.14
 *   0x6E / 0x6F   RPTBLOCAL / RPTB               sec.6.5.14
 *   0x9A hh ll d  BCC  long-relative (16-bit)    sec.6.5.1
 *   0x9B hh ll d  CALLCC long-relative           sec.6.5.5
 *   0x9C hh ll d  B    long-absolute (24-bit)    sec.6.5.2
 *   0x9D hh ll d  CALL long-absolute             sec.6.5.6
 *   0x9E / 0x9F   B / CALL with far() prefix     sec.6.5.2, sec.6.5.6
 *   0xD8 ...      BCC  far-absolute (5-byte)     sec.6.5.1
 *   0xD9 ...      CALLCC far-absolute            sec.6.5.5
 *   0xDA / 0xDB   BCC / BCCU short-form          sec.6.5.1
 *   0xDC / 0xDD   BCC / BCCU                     sec.6.5.1
 *   0xDE / 0xDF   BCC / BCCU                     sec.6.5.1
 *
 * Stack-affecting:
 *
 *   0x0D          PSHBOTH ACx (2 words)          sec.6.7.6
 *   0x0E          PSH dbl(ACx) (2 words)         sec.6.7
 *   0x0F          POP dbl(ACx) (2 words)
 *   0x61          PSH dbl(mem) (2 words)
 *   0x70          PSH dual-register (2 words)
 *   0x71          POP dual-register
 *   0x94          PSH ACx, mem (2 words)
 *
 * Byte-order note: C55x+ branch displacements and absolute targets are
 * stored MSB-first within the instruction stream even though the
 * surrounding processor is little-endian -- see SWPU104 sec.3.5. We use
 * rz_read_at_be16() / rz_read_at_be24() from rz_endian.h to extract
 * them unambiguously without unaligned-int dereference.
 */

/* Helper: sign-extend an n-bit value (for short conditional branch
 * relative displacements, which are 8-bit signed in some encodings
 * and 16-bit signed in others). */
static inline st32 sign_extend(ut32 v, ut32 bits) {
	const ut32 mask = (1u << bits) - 1;
	v &= mask;
	if (v & (1u << (bits - 1))) {
		return (st32)(v | ~mask);
	}
	return (st32)v;
}

/* Set conditional-jump fields: type=cjmp, jump=target, fail=fallthrough. */
static inline void set_cjmp(RzAnalysisOp *op, ut64 addr, ut64 target) {
	op->type = RZ_ANALYSIS_OP_TYPE_CJMP;
	op->jump = target;
	op->fail = addr + op->size;
	op->direction = RZ_ANALYSIS_OP_DIR_EXEC;
}

/* Set conditional-call fields: type=ccall, jump=target, fail=fallthrough. */
static inline void set_ccall(RzAnalysisOp *op, ut64 addr, ut64 target) {
	op->type = RZ_ANALYSIS_OP_TYPE_CCALL;
	op->jump = target;
	op->fail = addr + op->size;
	op->stackop = RZ_ANALYSIS_STACK_INC;
	op->stackptr = 2;
	op->direction = RZ_ANALYSIS_OP_DIR_EXEC;
}

/* Set unconditional-call fields: type=call, jump=target. */
static inline void set_call(RzAnalysisOp *op, ut64 target) {
	op->type = RZ_ANALYSIS_OP_TYPE_CALL;
	op->jump = target;
	op->stackop = RZ_ANALYSIS_STACK_INC;
	op->stackptr = 2;
	op->direction = RZ_ANALYSIS_OP_DIR_EXEC;
}

/* Set unconditional-jump fields. */
static inline void set_jmp(RzAnalysisOp *op, ut64 target) {
	op->type = RZ_ANALYSIS_OP_TYPE_JMP;
	op->jump = target;
	op->direction = RZ_ANALYSIS_OP_DIR_EXEC;
}

/* Mark an instruction as a return, with stack accounting. */
static inline void set_ret(RzAnalysisOp *op) {
	op->type = RZ_ANALYSIS_OP_TYPE_RET;
	op->eob = true;
	op->stackop = RZ_ANALYSIS_STACK_INC;
	op->stackptr = -2;
}

/* Conditional return -- like RET but doesn't end the basic block
 * (fallthrough is possible if the condition is false). */
static inline void set_cret(RzAnalysisOp *op) {
	op->type = RZ_ANALYSIS_OP_TYPE_CRET;
	op->fail = op->addr + op->size;
	op->stackop = RZ_ANALYSIS_STACK_INC;
	op->stackptr = -2;
}

/* Stack push: write+decrement. Track the byte delta. */
static inline void set_push(RzAnalysisOp *op, int delta) {
	op->type = RZ_ANALYSIS_OP_TYPE_PUSH;
	op->stackop = RZ_ANALYSIS_STACK_INC;
	op->stackptr = delta;
}

/* Stack pop: read+increment. Track the byte delta. */
static inline void set_pop(RzAnalysisOp *op, int delta) {
	op->type = RZ_ANALYSIS_OP_TYPE_POP;
	op->stackop = RZ_ANALYSIS_STACK_INC;
	op->stackptr = delta;
}

/* Record an immediate value (for "mov #k, dst" / "add #k, dst" etc.). */
static inline void set_imm(RzAnalysisOp *op, st64 val) {
	op->val = (ut64)val;
}

/* Record a memory access width (in bytes: 1, 2, or 4) for loads and
 * stores whose effective address is computed at runtime. */
static inline void set_mem_width(RzAnalysisOp *op, int width) {
	op->refptr = width;
	op->ptrsize = width;
}

