rizinorg/rizin/librz/arch/isa/tms320/c55x_plus/c55plus_analysis.c
/* Set op->reg (destination register name) for instructions whose
 * destination register is encoded statically in the leading byte(s).
 * The string is borrowed and must point to static storage. */
static inline void set_dst_reg(RzAnalysisOp *op, const char *name) {
	op->reg = name;
}

/* Set op->ireg (register used for indirect memory computation) for
 * register-indirect loads, stores, branches and calls (e.g. B ACx,
 * CALL ACx). The string is borrowed and must point to static storage. */
static inline void set_ireg(RzAnalysisOp *op, const char *name) {
	op->ireg = name;
}

/* Set op->direction so higher-level analysis knows whether the op
 * reads from memory (LOAD-style), writes to memory (STORE-style),
 * jumps (EXEC), or just references an address (REF). */
static inline void set_dir(RzAnalysisOp *op, RzAnalysisOpDirection dir) {
	op->direction = dir;
}

/* Set op->disp (displacement) for memory references that compute
 * their effective address as `base_register + disp`. */
static inline void set_disp(RzAnalysisOp *op, st64 disp) {
	op->disp = (ut64)disp;
}

/* ACx selector tables -- index 0..3 corresponds to AC0..AC3. */
static const char *const c55xp_acc_names[4] = { "ac0", "ac1", "ac2", "ac3" };

int tms320_c55x_plus_op(RzAnalysis *analysis, RzAnalysisOp *op, ut64 addr,
	const ut8 *buf, int len) {
	if (!op || !buf || len < 1) {
		return 0;
	}

	const ut32 ins_len = get_ins_len(buf[0]);
	if (ins_len == 0 || (int)ins_len > len) {
		return 0;
	}

	op->addr = addr;
	op->size = ins_len;
	op->type = RZ_ANALYSIS_OP_TYPE_NULL;

	/* Surface the named instruction ID (Capstone-style op->id), resolved
	 * from the C55x+ token decoder's decoded mnemonic. The type-level
	 * dispatch below stays byte-driven because C55x+ packs many distinct
	 * instructions behind each leading byte (disambiguated by operand
	 * bits the analyzer already inspects); the ID gives consumers the
	 * exact mnemonic without re-deriving it. */
	op->id = tms320c55x_plus_insn_id_decode(buf, len);

	switch (buf[0]) {
	/* ---- 0x00 family: NOP_16 / IDLE / RETI / to_word --------------- */
	case 0x00:
		if (ins_len < 2) {
			op->type = RZ_ANALYSIS_OP_TYPE_NOP;
			break;
		}
		switch (buf[1]) {
		case 0x20: /* IDLE */
			op->type = RZ_ANALYSIS_OP_TYPE_NOP;
			op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
			break;
		case 0xc0: /* RETI */
			set_ret(op);
			set_dst_reg(op, "sp");
			break;
		default:
			op->type = RZ_ANALYSIS_OP_TYPE_NOP;
			break;
		}
		break;

	/* ---- 0x01 family: rptsub --------------------------------------- */
	case 0x01:
		op->type = RZ_ANALYSIS_OP_TYPE_REP;
		break;

	/* ---- 0x02 family: B/CALL ACx indirect; both eob -----------------*/
	case 0x02: {
		if (ins_len < 2) {
			break;
		}
		/* Bit 7 of the second byte selects CALL (=1) vs B (=0).
		 * The low 2 bits of buf[1] select ACx (0..3). */
		const bool is_call = (buf[1] & 0x80) != 0;
		const ut8 ac_idx = buf[1] & 0x03;
		if (is_call) {
			op->type = RZ_ANALYSIS_OP_TYPE_UCALL;
			op->stackop = RZ_ANALYSIS_STACK_INC;
			op->stackptr = 2;
			set_dir(op, RZ_ANALYSIS_OP_DIR_EXEC);
		} else {
			op->type = RZ_ANALYSIS_OP_TYPE_UJMP;
			op->eob = true;
			set_dir(op, RZ_ANALYSIS_OP_DIR_EXEC);
		}
		set_ireg(op, c55xp_acc_names[ac_idx]);
		op->fail = addr + ins_len;
		break;
	}

	/* ---- 0x03 family: INTR / TRAP / SWAP / SIM_TRIG ---------------
	 * Differentiated by buf[1] high nibble:
	 *   0x0?,0x1?,0x2?,0x3?  -> intr #k5     (SWPU104 6.5.13)
	 *   0x4?,0x5?            -> trap #k5     (SWPU104 6.5.19)
	 *   0x8?,0x9?,0xa?,0xb?  -> swap regs    (SWPU104 6.7.x)
	 *   0xc?..0xf?           -> sim_trig     (Wrigley silicon)
	 */
	case 0x03:
		if (ins_len < 2) {
			break;
		}
		switch (buf[1] & 0xc0) {
		case 0x00: /* intr #k5 */
			op->type = RZ_ANALYSIS_OP_TYPE_SWI;
			set_imm(op, buf[1] & 0x1f);
			op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
			break;
		case 0x40: /* trap #k5 */
			op->type = RZ_ANALYSIS_OP_TYPE_TRAP;
			set_imm(op, buf[1] & 0x1f);
			op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
			break;
		case 0x80: /* swap */
			op->type = RZ_ANALYSIS_OP_TYPE_XCHG;
			break;
		case 0xc0: /* sim_trig - Wrigley simulator trigger */
			op->type = RZ_ANALYSIS_OP_TYPE_TRAP;
			op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
			break;
		}
		break;

	/* ---- 0x04 / 0x06: XCC (predicated execute) --------------------- */
	case 0x04:
	case 0x06:
		op->type = RZ_ANALYSIS_OP_TYPE_CMP;
		op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
		break;

	/* ---- 0x05 / 0x07: XCCPART -------------------------------------- */
	case 0x05:
	case 0x07:
		op->type = RZ_ANALYSIS_OP_TYPE_CMP;
		op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
		break;

	/* ---- 0x08: RETCC (conditional ret) ----------------------------- */
	case 0x08:
		set_cret(op);
		set_dst_reg(op, "sp");
		break;

	/* ---- 0x0A: BCLR/BSET status-register-bit ---------------------- */
	case 0x0a:
		/* Modifies a status-reg bit -- surface as MOV (the closest fit
		 * in the rizin optype set; the immediate-side bit pattern is
		 * not extracted here). */
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break;

	/* ---- 0x0C: AADD addr-add ------------------------------------- */
	case 0x0c:
		/* AADD K8, SP -- prologue/epilogue frame adjustment.
		 *
		 * Semantic: SP = SP + K8 (signed). rizin's convention is
		 * that op->stackptr is the amount by which SP *decreases*,
		 * so for AADD that is -K8. See c55x_analysis.c 0x4e and
		 * rz_analysis_op_apply_sp_effect() in librz/arch/op.c. */
		op->type = RZ_ANALYSIS_OP_TYPE_ADD;
		if (ins_len >= 2) {
			const st8 k8 = (st8)buf[1];
			set_imm(op, k8);
			set_dst_reg(op, "sp");
			set_disp(op, k8);
			op->stackop = RZ_ANALYSIS_STACK_INC;
			op->stackptr = -k8;
		}
		break;

	/* ---- 0x0D: PSHBOTH ------------------------------------------- */
	case 0x0d:
		op->type = RZ_ANALYSIS_OP_TYPE_UPUSH;
		op->stackop = RZ_ANALYSIS_STACK_INC;
		op->stackptr = 2;
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;

	/* ---- 0x0E / 0x0F: PSH/POP dbl -------------------------------- */
	case 0x0e:
		set_push(op, 2);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;
	case 0x0f:
		set_pop(op, -2);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_READ);
		break;

	/* ---- 0x20: NOP ----------------------------------------------- */
	case 0x20:
		op->type = RZ_ANALYSIS_OP_TYPE_NOP;
		break;

