rizinorg/rizin/librz/arch/isa/tms320/c55x_plus/c55plus_analysis.c
	/* ---- 0x21: RET ----------------------------------------------- */
	case 0x21:
		set_ret(op);
		set_dst_reg(op, "sp");
		break;

	/* ---- 0x24-0x26: PSH variants --------------------------------- */
	case 0x24:
	case 0x25:
	case 0x26:
		set_push(op, 1);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;
	/* ---- 0x27: CIRC -- circular addressing helper ---------------- */
	case 0x27:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break;

	/* ---- 0x60: DELAY -- memory-delay move (TI SWPU104 sec.6.7.1,
	 *     "Memory Delay", grouped under Move Operations). delay(Smem)
	 *     copies the word at Smem to the next-higher address Smem+1 (a
	 *     one-word memory-to-memory data shift used to build delay lines
	 *     in filters): one data read, one data write. It is a data MOV,
	 *     not a CPU/system-control op, so no FAMILY_CPU. -------------- */
	case 0x60:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		set_mem_width(op, 2);
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;

	/* ---- 0x61: PSH dbl(mem) -------------------------------------- */
	case 0x61:
		set_push(op, 2);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;

	/* ---- 0x68: B short-relative (16-bit) ------------------------- */
	case 0x68:
		if (ins_len >= 3) {
			const ut32 disp = rz_read_at_be16(buf, 1);
			set_jmp(op, addr + 3 + sign_extend(disp, 16));
			op->eob = true;
		}
		break;

	/* ---- 0x69: CALL short-relative ------------------------------- */
	case 0x69:
		if (ins_len >= 3) {
			const ut32 disp = rz_read_at_be16(buf, 1);
			set_call(op, addr + 3 + sign_extend(disp, 16));
			op->fail = addr + ins_len;
		}
		break;

	/* ---- 0x6A: BCC short-relative -------------------------------- */
	case 0x6a:
		if (ins_len >= 3) {
			/* 6A ss dst -- ss is 8-bit signed displacement. */
			set_cjmp(op, addr, addr + 3 + sign_extend(buf[1], 8));
		}
		break;

	/* ---- 0x6C: RPT ----------------------------------------------- */
	case 0x6c:
		op->type = RZ_ANALYSIS_OP_TYPE_REP;
		break;
	/* ---- 0x6D: RPTCC --------------------------------------------- */
	case 0x6d:
		op->type = RZ_ANALYSIS_OP_TYPE_REP;
		op->fail = addr + ins_len;
		break;
	/* ---- 0x6E/0x6F: RPTBLOCAL / RPTB ----------------------------- */
	case 0x6e:
	case 0x6f:
		op->type = RZ_ANALYSIS_OP_TYPE_REP;
		break;

	/* ---- 0x70/0x71: PSH/POP dual-register ------------------------ */
	case 0x70:
		set_push(op, 2);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;
	case 0x71:
		set_pop(op, -2);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_READ);
		break;

	/* ---- 0x72: ASUB addr-sub ------------------------------------- */
	case 0x72:
		op->type = RZ_ANALYSIS_OP_TYPE_SUB;
		break;

	/* ---- 0x74-0x76: ADD/AND/{ABS/NEG/MAX/MIN} -------------------- */
	case 0x74:
		/* ADD smem,ACx -- but bit 7 of buf[2] flips ADD <-> SUB
		 * for one of the addressing-mode subforms. */
		if (ins_len >= 3 && (buf[2] & 0x80)) {
			op->type = RZ_ANALYSIS_OP_TYPE_SUB;
		} else {
			op->type = RZ_ANALYSIS_OP_TYPE_ADD;
		}
		break;
	case 0x75: op->type = RZ_ANALYSIS_OP_TYPE_AND; break;
	case 0x76:
		/* 0x76 family -- unary arithmetic on accumulators. The two
		 * MSB-of-byte bits select the subfamily:
		 *
		 *   buf[1] & 0x80 == 0:  ABS (buf[2]&0x80==0) or NEG (==1)
		 *   buf[1] & 0x80 == 1:  MAX (buf[2]&0x80==0) or MIN (==1)
		 *
		 * ABS has no clean rizin optype (the RZ_ANALYSIS_OP_TYPE_ABS
		 * code 44 is missing from the optypes table -- renders as
		 * 'undefined') so we leave it at NULL. */
		if (ins_len >= 3) {
			const ut8 b1_top = buf[1] & 0x80;
			const ut8 b2_top = buf[2] & 0x80;
			if (b1_top) {
				op->type = RZ_ANALYSIS_OP_TYPE_CMP; /* MAX/MIN */
				(void)b2_top;
			} else if (b2_top) {
				op->type = RZ_ANALYSIS_OP_TYPE_SUB; /* NEG */
			} else {
				/* ABS -- see comment above */
				op->type = RZ_ANALYSIS_OP_TYPE_NULL;
			}
		}
		break;

	/* ---- 0x77: MOV ----------------------------------------------- */
	case 0x77:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break;

	/* ---- 0x79: ROUND --------------------------------------------- */
	case 0x79:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break;

	/* ---- 0x7B: Ra = Ra +/- k4 | Ra <</>> #1 | Ra = k4 -------------
	 * Per TI SWPU104 Table 7-2 (opcode 01111011):
	 *   byte1 bit7 (0x80) set   -> LD   (Ra = k4)            -> MOV
	 *   byte1 bit7 (0x80) clear -> arithmetic/shift on Ra, where
	 *       byte2 bit4 (0x10) set -> shift by 1 (SFTA)       -> SHL
	 *       byte2 bit4 (0x10) clr -> add/sub k4, with
	 *           byte2 bit7 (0x80) set -> SUB else ADD
	 * The k4 immediate is the low nibble of byte2. */
	case 0x7b:
		if (ins_len >= 3) {
			if (buf[1] & 0x80) {
				/* LD Ra, #k4 -- load immediate */
				op->type = RZ_ANALYSIS_OP_TYPE_MOV;
				set_imm(op, buf[2] & 0x0f);
			} else if (buf[2] & 0x10) {
				/* SFTA Ra, #1 -- arithmetic shift by one */
				op->type = (buf[2] & 0x80) ? RZ_ANALYSIS_OP_TYPE_SHR : RZ_ANALYSIS_OP_TYPE_SHL;
			} else if (buf[2] & 0x80) {
				/* SUB Ra, #k4 */
				op->type = RZ_ANALYSIS_OP_TYPE_SUB;
				set_imm(op, buf[2] & 0x0f);
			} else {
				/* ADD Ra, #k4 */
				op->type = RZ_ANALYSIS_OP_TYPE_ADD;
				set_imm(op, buf[2] & 0x0f);
			}
		} else {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		}
		break;

	/* ---- 0x80/0x81/0x82: ADD/SUB long-imm ------------------------ */
	case 0x80: op->type = RZ_ANALYSIS_OP_TYPE_ADD; break;
	case 0x81:
	case 0x82: op->type = RZ_ANALYSIS_OP_TYPE_SUB; break;

	/* ---- 0x84/0x85/0x86: AND/OR/XOR ------------------------------ */
	case 0x84: op->type = RZ_ANALYSIS_OP_TYPE_AND; break;
	case 0x85: op->type = RZ_ANALYSIS_OP_TYPE_OR; break;
	case 0x86: op->type = RZ_ANALYSIS_OP_TYPE_XOR; break;

	/* ---- 0x89: BCLR --------------------------------------------- */
	case 0x89:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break;

	/* ---- 0x8D / 0x8E: ADD smem,ACx ------------------------------ */
	case 0x8d:
	case 0x8e:
		op->type = RZ_ANALYSIS_OP_TYPE_ADD;
		break;

	/* ---- 0x90/0x91/0x92/0x93/0x94: various ----------------------- */
	case 0x90: op->type = RZ_ANALYSIS_OP_TYPE_ADD; break;
	case 0x91: op->type = RZ_ANALYSIS_OP_TYPE_AND; break; /* btstclr */
	case 0x92:
	case 0x93: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break; /* sqrm */
	case 0x94:
		set_push(op, 2);
		set_dst_reg(op, "sp");
		set_dir(op, RZ_ANALYSIS_OP_DIR_WRITE);
		break;

	/* ---- 0x9A: BCC long-relative (16-bit) ------------------------ */
	case 0x9a:
		if (ins_len >= 4) {
			const ut32 disp = rz_read_at_be16(buf, 1);
			set_cjmp(op, addr, addr + ins_len + sign_extend(disp, 16));
		}
		break;

	/* ---- 0x9B: CALLCC long-relative ------------------------------ */
	case 0x9b:
		if (ins_len >= 4) {
			const ut32 disp = rz_read_at_be16(buf, 1);
			set_ccall(op, addr, addr + ins_len + sign_extend(disp, 16));
		}
		break;

	/* ---- 0x9C: B long-absolute (24-bit) -------------------------- */
	case 0x9c:
		if (ins_len >= 4) {
			set_jmp(op, rz_read_at_be24(buf, 1));
			op->eob = true;
		}
		break;

	/* ---- 0x9D: CALL long-absolute -------------------------------- */
	case 0x9d:
		if (ins_len >= 4) {
			set_call(op, rz_read_at_be24(buf, 1));
			op->fail = addr + ins_len;
		}
		break;

	/* ---- 0x9E / 0x9F: B / CALL with far() prefix ----------------- */
	case 0x9e:
		if (ins_len >= 4) {
			set_jmp(op, rz_read_at_be24(buf, 1));
			op->eob = true;
		}
		break;
	case 0x9f:
		if (ins_len >= 4) {
			set_call(op, rz_read_at_be24(buf, 1));
			op->fail = addr + ins_len;
		}
		break;

	/* ---- 0xA1/0xA4/0xA6/0xA7/0xA8: arith & compare --------------- */
	case 0xa1: op->type = RZ_ANALYSIS_OP_TYPE_ADD; break;
	case 0xa4: op->type = RZ_ANALYSIS_OP_TYPE_CMP; break;
	case 0xa6:
	case 0xa7: op->type = RZ_ANALYSIS_OP_TYPE_SHL; break; /* SFTS/SFTL */
	case 0xa8: op->type = RZ_ANALYSIS_OP_TYPE_ROL; break;
	case 0xa9: op->type = RZ_ANALYSIS_OP_TYPE_MOV; break; /* EXP */
	case 0xaa:
	case 0xab: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break;
	case 0xae:
		op->type = RZ_ANALYSIS_OP_TYPE_SUB;
		break;

