rizinorg/rizin/librz/arch/isa/tms320/c55x_plus/c55plus_analysis.c
	/* ---- 0xB0: BCC short-form (3-byte conditional jump) ---------- */
	case 0xb0:
		if (ins_len >= 4) {
			const ut32 disp = rz_read_at_be16(buf, 2);
			set_cjmp(op, addr, addr + ins_len + sign_extend(disp, 16));
		}
		break;
	case 0xb1:
		op->type = RZ_ANALYSIS_OP_TYPE_ADD;
		break;
	case 0xb2:
		op->type = RZ_ANALYSIS_OP_TYPE_CMP;
		break;
	case 0xb3:
		op->type = RZ_ANALYSIS_OP_TYPE_ADD;
		break;

	/* ---- 0xB8/0xB9/0xBA/0xBB: MAC/MPY families ------------------- */
	case 0xb8:
	case 0xb9:
	case 0xba:
	case 0xbb: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break;
	case 0xbc:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break; /* BFXTR */

	/* ---- 0xC1/0xC3/0xC5: AND/OR/XOR long-imm ---------------------
	 * For 0xC5 specifically, bit 7 of buf[1] selects XOR (=1);
	 * if not XOR, bit 7 of buf[2] picks OR (=1) over AND (=0). The
	 * 0xC1 and 0xC3 slots are AND / OR variants for different
	 * addressing forms (mem vs ACx) -- they have only one operation. */
	case 0xc1: op->type = RZ_ANALYSIS_OP_TYPE_AND; break;
	case 0xc3: op->type = RZ_ANALYSIS_OP_TYPE_OR; break;
	case 0xc5:
		if (ins_len >= 3 && (buf[1] & 0x80)) {
			op->type = RZ_ANALYSIS_OP_TYPE_XOR;
		} else if (ins_len >= 3 && (buf[2] & 0x80)) {
			op->type = RZ_ANALYSIS_OP_TYPE_OR;
		} else {
			op->type = RZ_ANALYSIS_OP_TYPE_AND;
		}
		break;
	case 0xc6: op->type = RZ_ANALYSIS_OP_TYPE_MOV; break; /* BFXTR / BFXPA - bit-field extract / pack */
	case 0xc7: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break; /* MPYK */
	case 0xc8:
	case 0xc9:
	case 0xca:
	case 0xcb: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break;
	case 0xce: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break; /* SQDST */

	case 0xd1:
		op->type = RZ_ANALYSIS_OP_TYPE_MOV;
		break; /* COPY */
	/* ---- 0xD2: mar(XDAa op k24) -- modify extended address register.
	 * Per TI SWPU104 Table 7-2 (opcode 11010010), byte1 bits 6-5 select
	 *   00 -> mar(XDAa - k24)   (ASUB)
	 *   01 -> mar(XDAa + k24)   (AMOV/AADD with +)
	 *   10 -> mar(XDAa = k24)   (AMOV load)
	 * All are address-register arithmetic/loads, classified LEA (the
	 * same family as 0x14 AADD and 0x77 AMOV). The earlier code typed
	 * this SUB, which mis-classified the load and add forms. */
	case 0xd2: op->type = RZ_ANALYSIS_OP_TYPE_LEA; break;
	case 0xd4:
		op->type = RZ_ANALYSIS_OP_TYPE_CMP;
		break; /* MAXDIFF */

	/* ---- 0xD8: BCC far-absolute (5-byte) ------------------------- */
	case 0xd8:
		if (ins_len >= 5) {
			set_cjmp(op, addr, rz_read_at_be24(buf, 1));
		}
		break;

	/* ---- 0xD9: CALLCC far-absolute (5-byte) ---------------------- */
	case 0xd9:
		if (ins_len >= 5) {
			set_ccall(op, addr, rz_read_at_be24(buf, 1));
		}
		break;

	/* ---- 0xDA-0xDF: BCC/BCCU register-compare conditional ------- */
	case 0xda:
	case 0xdb:
	case 0xdc:
	case 0xdd:
	case 0xde:
	case 0xdf:
		/* 5-byte form: DA/DB ARx cmp RRx ll hh dd (16-bit signed disp).
		 * The target is encoded as a relative 16-bit displacement
		 * at bytes 3..4 in BE byte order. */
		if (ins_len >= 5) {
			const ut32 disp = rz_read_at_be16(buf, 3);
			set_cjmp(op, addr, addr + ins_len + sign_extend(disp, 16));
		}
		break;

	/* ---- 0xE0/0xE1/0xE2/0xE3/0xE8/0xE9/0xEC/0xED: MAC/MPY parallel  */
	case 0xe0:
	case 0xe1:
	case 0xe2:
	case 0xe3:
	case 0xe8:
	case 0xe9:
	case 0xec:
	case 0xed: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break;
	case 0xea:
	case 0xeb: op->type = RZ_ANALYSIS_OP_TYPE_LEA; break; /* AMAR parallel */
	case 0xee: op->type = RZ_ANALYSIS_OP_TYPE_MUL; break; /* MPYK */

	default:
		/* MOV-family bytes 0x48-0x4F (mov #imm, mem) - common in
		 * real firmware, classified as MOV here. */
		if (buf[0] >= 0x48 && buf[0] <= 0x4f) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			break;
		}
		/* Memory<->register MOV cluster, byte 0x50-0x5F. Per the
		 * SWPU104 encoding map: 0x50 (mem <- ARx high), 0x51-0x53
		 * (mem <- ACx parts), 0x54-0x57 (COPY), 0x58 (mem -> ACx),
		 * 0x59 (mem<<16 -> ACx), 0x5A/0x5B (mem -> ACx halves),
		 * 0x5C (40-bit dbl mov), 0x5D (ACx >> 1 -> dbl mem). All
		 * MOV-family for analysis purposes; the 0x5C / 0x5D dbl
		 * forms access 4 bytes, the rest 2. */
		if (buf[0] >= 0x50 && buf[0] <= 0x5f) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			set_mem_width(op, (buf[0] == 0x5c || buf[0] == 0x5d) ? 4 : 2);
			break;
		}
		/* AMAR family - address-modifying instructions (LEA-like). */
		if (buf[0] == 0x62 || buf[0] == 0x63) {
			op->type = RZ_ANALYSIS_OP_TYPE_LEA;
			break;
		}
		/* MOV-family bytes 0x88, 0x8A: ACx <-> mem variants. */
		if (buf[0] == 0x88 || buf[0] == 0x8a) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			break;
		}
		/* 0x8C: ADD with carry, mem -> ACx. */
		if (buf[0] == 0x8c) {
			op->type = RZ_ANALYSIS_OP_TYPE_ADD;
			break;
		}
		/* 0x97: dual-mem MOV. */
		if (buf[0] == 0x97) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			break;
		}
		/* 0xA0, 0xAC, 0xAD: MOV with parallel dual addressing or
		 * MOV #imm,ACx (long form). */
		if (buf[0] == 0xa0 || buf[0] == 0xac || buf[0] == 0xad) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			break;
		}
		/* 0xB4, 0xB5: MOV with rounding / shift. */
		if (buf[0] == 0xb4 || buf[0] == 0xb5) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			break;
		}
		/* 0xB6, 0xB7: ADD with shift (T-register or immediate). */
		if (buf[0] == 0xb6 || buf[0] == 0xb7) {
			op->type = RZ_ANALYSIS_OP_TYPE_ADD;
			break;
		}
		/* 0xC0, 0xC2, 0xC4: ADD #k16 with optional shift. */
		if (buf[0] == 0xc0 || buf[0] == 0xc2 || buf[0] == 0xc4) {
			op->type = RZ_ANALYSIS_OP_TYPE_ADD;
			break;
		}
		/* 0xCC: dual-instruction packed encoding (ADD :: MOV). The
		 * primary operation that affects control flow / data flow
		 * is the ADD, so classify as ADD. */
		if (buf[0] == 0xcc) {
			op->type = RZ_ANALYSIS_OP_TYPE_ADD;
			break;
		}
		/* 0xD0: MOV ACx, dbl(*(#abs24)) -- 4-byte (dbl) memory move. */
		if (buf[0] == 0xd0) {
			op->type = RZ_ANALYSIS_OP_TYPE_MOV;
			set_mem_width(op, 4);
			break;
		}
		/* 0x2E, 0x2F: XCCPART predicated execute. */
		if (buf[0] == 0x2e || buf[0] == 0x2f) {
			op->type = RZ_ANALYSIS_OP_TYPE_CMP;
			op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
			break;
		}
		/* 0x0B (ecopr__), 0x23 (estop_byte): pseudo opcodes
		 * specific to the Wrigley silicon. Used as emulation /
		 * coprocessor traps; classify as TRAP. */
		if (buf[0] == 0x0b || buf[0] == 0x23) {
			op->type = RZ_ANALYSIS_OP_TYPE_TRAP;
			op->family = RZ_ANALYSIS_OP_FAMILY_CPU;
			break;
		}
		/* Anything we have not catalogued: leave op->type at its
		 * default (NULL).  We intentionally do NOT mark unknown
		 * leading bytes as ILL: many bytes in the 0x10..0x1f and
		 * 0x30..0x3f ranges are valid parallel-instruction prefixes
		 * (0x39 = MACK, etc.) that decode to multi-instruction
		 * forms only when paired with the right following bytes.
		 * Flagging them as ILL would mislead the basic-block
		 * walker and the colorizer, which treats ILL as
		 * "definitely-invalid" and renders the opcode in bold
		 * red. Leaving as NULL lets the disassembler's own
		 * "invalid" rendering speak for itself per-instruction. */
		break;
	}

	/* The byte-level switch above handles control flow (targets, fail
	 * paths), stack deltas and operand fields, but it cannot always tell
	 * apart instructions that share a leading byte but differ by operand
	 * bits (e.g. ADD vs SUB, AND vs OR vs XOR, AMOV vs ASUB, PSH vs POP).
	 * The decoder already resolved the exact mnemonic, so for the
	 * arithmetic / logical / move / multiply / stack families take the
	 * authoritative type from the instruction id. Control flow, repeats,
	 * XCC and the like map to NULL here and keep the type the byte switch
	 * assigned. Stack-effect bookkeeping (stackop/stackptr) set above is
	 * preserved. */
	const int id_type = tms320c55x_insn_optype((TMS320C55InsID)op->id);
	if (id_type != RZ_ANALYSIS_OP_TYPE_NULL) {
		op->type = id_type;
	}

	return op->size;
}
